OpenFOAMcases/ASJ/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    out
    {
        type            calculated;
        value           uniform 0;
    }

    "(jet|jetwall)"
    {
        type            fixedValue;
        value           uniform 0;
    }

    /*center
    {
        type            symmetryPlane;
    }*/

    back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
