OpenFOAMcases/ASJ/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pin             1.19671e5;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{

    jet
    {
      type               fixedValue;
      value              uniform $pin;
	  //p0                 uniform $pin;
	}

    out
    {
      //type		fixedValue;
	  //value		uniform 1e5;
	  type               freestreamPressure;
      freestreamValue    uniform 1e5;
    }

    jetwall
    {
        type            zeroGradient;
    }

    back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }
	//#includeEtc "caseDicts/setConstrainTypes"
}


// ************************************************************************* //
