OpenFOAMcases/ASJ/constant/modifiedFunc
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  v2106                                 | 
|   \\  /    A nd           | Website:  www.openfoam.com                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      DNSDict_; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
chitmp
(
    0.000000e+00
    5.000000e-02
    1.000000e-01
    1.500000e-01
    2.000000e-01
    2.500000e-01
    3.000000e-01
    3.500000e-01
    4.000000e-01
    4.500000e-01
    5.000000e-01
    5.500000e-01
    6.000000e-01
    6.500000e-01
    7.000000e-01
    7.500000e-01
    8.000000e-01
    8.500000e-01
    9.000000e-01
    9.500000e-01
    1.000000e+00
    1.050000e+00
    1.100000e+00
    1.150000e+00
    1.200000e+00
    1.250000e+00
    1.300000e+00
    1.350000e+00
    1.400000e+00
    1.450000e+00
    1.500000e+00
    1.550000e+00
    1.600000e+00
    1.650000e+00
    1.700000e+00
    1.750000e+00
    1.800000e+00
    1.850000e+00
    1.900000e+00
    1.950000e+00
    2.000000e+00
    2.050000e+00
    2.100000e+00
    2.150000e+00
    2.200000e+00
    2.250000e+00
    2.300000e+00
    2.350000e+00
    2.400000e+00
    2.450000e+00
    2.500000e+00
    2.550000e+00
    2.600000e+00
    2.650000e+00
    2.700000e+00
    2.750000e+00
    2.800000e+00
    2.850000e+00
    2.900000e+00
    2.950000e+00
    3.000000e+00
    3.050000e+00
    3.100000e+00
    3.150000e+00
    3.200000e+00
    3.250000e+00
    3.300000e+00
    3.350000e+00
    3.400000e+00
    3.450000e+00
    3.500000e+00
    3.550000e+00
    3.600000e+00
    3.650000e+00
    3.700000e+00
    3.750000e+00
    3.800000e+00
    3.850000e+00
    3.900000e+00
    3.950000e+00
    4.000000e+00
    4.050000e+00
    4.100000e+00
    4.150000e+00
    4.200000e+00
    4.250000e+00
    4.300000e+00
    4.350000e+00
    4.400000e+00
    4.450000e+00
    4.500000e+00
    4.550000e+00
    4.600000e+00
    4.650000e+00
    4.700000e+00
    4.750000e+00
    4.800000e+00
    4.850000e+00
    4.900000e+00
...
);

fv1tmp
(
    0.000000e+00
    3.940366e-05
    1.601593e-04
    3.722609e-04
    6.608758e-04
    1.051528e-03
    1.527461e-03
    2.090813e-03
    2.763490e-03
    3.521752e-03
    4.362839e-03
    5.317203e-03
    6.367870e-03
    7.495545e-03
    8.708382e-03
    1.003072e-02
    1.144556e-02
    1.293541e-02
    1.448570e-02
    1.612914e-02
    1.786680e-02
    1.968180e-02
    2.155724e-02
    2.348430e-02
    2.549161e-02
    2.757261e-02
    2.971425e-02
    3.190346e-02
    3.413494e-02
    3.642954e-02
    3.878104e-02
    4.117971e-02
    4.361579e-02
    4.608350e-02
    4.859803e-02
    5.115629e-02
    5.375127e-02
    5.637597e-02
    5.902398e-02
    6.170412e-02
    6.441792e-02
    6.716049e-02
    6.992696e-02
    7.271242e-02
    7.551714e-02
    7.834761e-02
    8.120082e-02
    8.407344e-02
    8.696212e-02
    8.986379e-02
    9.278251e-02
    9.571936e-02
    9.867208e-02
    1.016385e-01
    1.046162e-01
    1.076039e-01
    1.106051e-01
    1.136193e-01
    1.166452e-01
    1.196811e-01
    1.227256e-01
    1.257778e-01
    1.288404e-01
    1.319128e-01
    1.349940e-01
    1.380830e-01
    1.411787e-01
    1.442805e-01
    1.473902e-01
    1.505075e-01
    1.536318e-01
    1.567623e-01
    1.598983e-01
    1.630391e-01
    1.661856e-01
    1.693384e-01
    1.724967e-01
    1.756602e-01
    1.788281e-01
    1.820000e-01
    1.851758e-01
    1.883566e-01
    1.915420e-01
    1.947316e-01
    1.979249e-01
    2.011214e-01
    2.043207e-01
    2.075235e-01
    2.107301e-01
    2.139401e-01
    2.171531e-01
    2.203687e-01
    2.235865e-01
    2.268063e-01
    2.300288e-01
    2.332541e-01
    2.364818e-01
    2.397116e-01
    2.429430e-01
...
);

fv2tmp
(
    1.015200e+00
    9.477888e-01
    8.999993e-01
    8.500003e-01
    8.000176e-01
    7.500425e-01
    7.001125e-01
    6.502259e-01
    6.003780e-01
    5.506467e-01
    5.010444e-01
    4.515045e-01
    4.021298e-01
    3.530306e-01
    3.041774e-01
    2.554711e-01
    2.070318e-01
    1.589823e-01
    1.114273e-01
    6.419072e-02
    1.729943e-02
    -2.910893e-02
    -7.489678e-02
    -1.199956e-01
    -1.646418e-01
    -2.087495e-01
    -2.521756e-01
    -2.947770e-01
    -3.365089e-01
    -3.776423e-01
    -4.180833e-01
    -4.576927e-01
    -4.963311e-01
    -5.339323e-01
    -5.708049e-01
    -6.068929e-01
    -6.420658e-01
    -6.761931e-01
    -7.091611e-01
    -7.412613e-01
    -7.725542e-01
    -8.029195e-01
    -8.322370e-01
    -8.603864e-01
    -8.874543e-01
    -9.137487e-01
    -9.391702e-01
    -9.636073e-01
    -9.869482e-01
    -1.009095e+00
    -1.030382e+00
    -1.050913e+00
    -1.070581e+00
    -1.089277e+00
    -1.106896e+00
    -1.123399e+00
    -1.139213e+00
    -1.154341e+00
    -1.168673e+00
    -1.182097e+00
    -1.194504e+00
    -1.205890e+00
    -1.216744e+00
    -1.227037e+00
    -1.236641e+00
    -1.245431e+00
    -1.253280e+00
    -1.260151e+00
    -1.266670e+00
    -1.272832e+00
    -1.278453e+00
    -1.283349e+00
    -1.287335e+00
    -1.290242e+00
    -1.292676e+00
    -1.294953e+00
    -1.296963e+00
    -1.298594e+00
    -1.299733e+00
    -1.300269e+00
    -1.300143e+00
    -1.299481e+00
    -1.298383e+00
    -1.296943e+00
    -1.295258e+00
    -1.293421e+00
    -1.291520e+00
    -1.289149e+00
    -1.286131e+00
    -1.282597e+00
    -1.278679e+00
    -1.274507e+00
    -1.270213e+00
    -1.265887e+00
    -1.261243e+00
    -1.256242e+00
    -1.250946e+00
    -1.245415e+00
    -1.239709e+00
...
);

rtmp
(
    0.000000e+00
    1.000000e-02
    2.000000e-02
    3.000000e-02
    4.000000e-02
    5.000000e-02
    6.000000e-02
    7.000000e-02
    8.000000e-02
    9.000000e-02
    1.000000e-01
    1.100000e-01
    1.200000e-01
    1.300000e-01
    1.400000e-01
    1.500000e-01
    1.600000e-01
    1.700000e-01
    1.800000e-01
    1.900000e-01
    2.000000e-01
    2.100000e-01
    2.200000e-01
    2.300000e-01
    2.400000e-01
    2.500000e-01
    2.600000e-01
    2.700000e-01
    2.800000e-01
    2.900000e-01
    3.000000e-01
    3.100000e-01
    3.200000e-01
    3.300000e-01
    3.400000e-01
    3.500000e-01
    3.600000e-01
    3.700000e-01
    3.800000e-01
    3.900000e-01
    4.000000e-01
    4.100000e-01
    4.200000e-01
    4.300000e-01
    4.400000e-01
    4.500000e-01
    4.600000e-01
    4.700000e-01
    4.800000e-01
    4.900000e-01
    5.000000e-01
    5.100000e-01
    5.200000e-01
    5.300000e-01
    5.400000e-01
    5.500000e-01
    5.600000e-01
    5.700000e-01
    5.800000e-01
    5.900000e-01
    6.000000e-01
    6.100000e-01
    6.200000e-01
    6.300000e-01
    6.400000e-01
    6.500000e-01
    6.600000e-01
    6.700000e-01
    6.800000e-01
    6.900000e-01
    7.000000e-01
    7.100000e-01
    7.200000e-01
    7.300000e-01
    7.400000e-01
    7.500000e-01
    7.600000e-01
    7.700000e-01
    7.800000e-01
    7.900000e-01
    8.000000e-01
    8.100000e-01
    8.200000e-01
    8.300000e-01
    8.400000e-01
    8.500000e-01
    8.600000e-01
    8.700000e-01
    8.800000e-01
    8.900000e-01
    9.000000e-01
    9.100000e-01
    9.200000e-01
    9.300000e-01
    9.400000e-01
    9.500000e-01
    9.600000e-01
    9.700000e-01
    9.800000e-01
...
);

fwtmp
(
    0.000000e+00
    1.346569e-02
    2.667161e-02
    3.962002e-02
    5.231315e-02
    6.475324e-02
    7.694253e-02
    8.888326e-02
    1.005777e-01
    1.120280e-01
    1.232365e-01
    1.342053e-01
    1.449368e-01
    1.554332e-01
    1.656967e-01
    1.757296e-01
    1.855340e-01
    1.951123e-01
    2.044666e-01
    2.135992e-01
    2.225124e-01
    2.312084e-01
    2.396894e-01
    2.479576e-01
    2.560154e-01
    2.638649e-01
    2.715084e-01
    2.789481e-01
    2.861863e-01
    2.932251e-01
    3.000669e-01
    3.067139e-01
    3.131683e-01
    3.194324e-01
    3.255083e-01
    3.313984e-01
    3.371048e-01
    3.426299e-01
    3.479758e-01
    3.531448e-01
    3.581392e-01
    3.629611e-01
    3.676128e-01
    3.720965e-01
    3.764146e-01
    3.805063e-01
    3.837031e-01
    3.875553e-01
    3.919367e-01
    3.968590e-01
    4.023297e-01
    4.083523e-01
    4.149268e-01
    4.220491e-01
    4.297119e-01
    4.379042e-01
    4.466122e-01
    4.558186e-01
    4.655036e-01
    4.756446e-01
    4.862167e-01
    4.971928e-01
    5.085436e-01
    5.202384e-01
    5.322449e-01
    5.445297e-01
    5.570583e-01
    5.697959e-01
    5.827071e-01
    5.957567e-01
    6.089097e-01
    6.221318e-01
    6.353899e-01
    6.486519e-01
    6.618878e-01
    6.750696e-01
    6.881716e-01
    7.011713e-01
    7.140494e-01
    7.267903e-01
    7.393827e-01
    7.518199e-01
    7.641002e-01
    7.762276e-01
    7.882118e-01
    8.000695e-01
    8.118240e-01
    8.235064e-01
    8.351558e-01
    8.468197e-01
    8.585550e-01
    8.704282e-01
    8.825158e-01
    8.949056e-01
    9.076965e-01
    9.209995e-01
    9.349382e-01
    9.496496e-01
    9.652844e-01
...
);



// ************************************************************************* //
